{
  "findings": [
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "Schulconnex-Server",
      "rationale": "Der Schulconnex-Server ist ein zentraler Bestandteil des Schulconnex-Systems und dient als Datenübermittler zwischen Schulverwaltung und angebundenen Anwendungen. Im Sinne der Schnittstelle ist dies ein spezifischer Begriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "Personenkontext",
      "rationale": "Ein Personenkontext bezeichnet den spezifischen Kontext einer Person innerhalb einer Organisation, einschließlich ihrer Rolle. Im Schulconnex-System ist dies ein zentraler Begriff zur Datenstrukturierung."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "DSGVO",
      "rationale": "Die Datenschutz-Grundverordnung (DSGVO) ist eine europäische Verordnung, die den Umgang mit personenbezogenen Daten regelt. Sie ist im Kontext des Schulconnex-Systems relevant für die gesetzliche Grundlage der Datenlöschung."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "Art. 17 DSGVO",
      "rationale": "Artikel 17 der DSGVO regelt das Recht auf Löschung bzw. das Recht auf Vergessenwerden und ist eine zentrale gesetzliche Grundlage für die Datenlöschung im Schulconnex-System."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "HTTP-DELETE",
      "rationale": "HTTP-DELETE ist eine Methode des HTTP-Protokolls, die im Schulconnex-System für die Löschung von Personenkontexten und Personen verwendet wird. Es ist ein spezifischer Schnittstellenbegriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "API",
      "rationale": "API steht für Application Programming Interface und bezeichnet die Schnittstelle, über die Dienste mit dem Schulconnex-System kommunizieren. Im Kontext des Schulconnex-Systems ist dies ein zentraler technischer Begriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "/personenkontexte/{id}",
      "rationale": "Dieser API-Endpunkt wird im Schulconnex-System verwendet, um spezifische Personenkontexte zu löschen. Es handelt sich um einen spezifischen Schnittstellenbegriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "/personen/{id}",
      "rationale": "Dieser API-Endpunkt wird im Schulconnex-System verwendet, um spezifische Personen zu löschen. Es handelt sich um einen spezifischen Schnittstellenbegriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "/personen-info",
      "rationale": "Dieser API-Endpunkt liefert Informationen zu aktiven Personenkontexten und geplanten Löschzeitpunkten im Schulconnex-System. Es handelt sich um einen spezifischen Schnittstellenbegriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-löschen.md",
      "term": "Fehlercode 400/13",
      "rationale": "Der Fehlercode 400/13 wird im Schulconnex-System zurückgegeben, wenn eine direkte Löschung von Personenkontexten nicht möglich ist. Es handelt sich um einen spezifischen Schnittstellenbegriff."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Schulconnex-Service",
      "rationale": "Ein Service, der den Vorgaben der Schulconnex-Spezifikation folgt und für die Bereitstellung und Übermittlung von Daten an angebundene Dienste genutzt wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "UUID",
      "rationale": "Steht für Universally Unique Identifier und wird im Schulconnex-Service zur eindeutigen Identifikation von Personen und Gruppen verwendet."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Personenkontext",
      "rationale": "Kontext der Person, in dem ein Dienst genutzt wird, umfasst eine Organisation und eine Rolle der Person in Bezug auf diese Organisation."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "laufzeit",
      "rationale": "Ein Attribut, das die zeitliche Gültigkeit einer Gruppe im Schulconnex-Service beschreibt und bei Aktualisierungen angepasst werden muss."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "jahrgangsstufe",
      "rationale": "Ein Feld im Personenkontext, das die aktuelle Jahrgangsstufe einer lernenden Person angibt und beim Schuljahreswechsel aktualisiert werden muss."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Regelsynchronisation",
      "rationale": "Bezeichnet die standardisierte Synchronisation von Daten zwischen Quellsystemen und dem Schulconnex-Service, unabhängig von Lernperiodenwechseln."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Lernperiode",
      "rationale": "Bezeichnet einen zeitlichen Abschnitt im Schulbetrieb, wie Schuljahr oder Schulhalbjahr, der für die Datenhaltung im Schulconnex-Service relevant ist."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Quellsystem",
      "rationale": "System, das Daten an den Schulconnex-Service übermittelt und für die Synchronisation und Aktualisierung der Daten verantwortlich ist."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-schuljahrwechsel.md",
      "term": "Synchronisationsfunktion",
      "rationale": "Eine Funktion im Quellsystem, die den Abgleich und die Aktualisierung von Daten mit dem Schulconnex-Service ermöglicht."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Schulconnex-Service",
      "rationale": "Ein Service, der den Vorgaben der Schulconnex-Spezifikation folgt und spezifisch für die Synchronisation von Daten im Schulbereich konzipiert ist."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Quellsystem",
      "rationale": "Bezeichnet im Kontext der Synchronisation das primäre System, das Stammdaten verwaltet und mit dem Schulconnex-Service interagiert."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "REST-API",
      "rationale": "Steht für Representational State Transfer Application Programming Interface und beschreibt die Schnittstelle zur Kommunikation zwischen dem Quellsystem und dem Schulconnex-Service."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "OAuth2",
      "rationale": "Ein Sicherheitsprotokoll für die Token-basierte Autorisierung und Authentifizierung, das im Kontext der Schulconnex-Synchronisation verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Password Credentials Grant",
      "rationale": "Ein spezifischer Flow des OAuth2-Protokolls, der für die Authentifizierung des Quellsystems bei der REST-API des Schulconnex-Services genutzt wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Access Token",
      "rationale": "Ein Token, das nach erfolgreicher Authentifizierung des Quellsystems über OAuth2 generiert wird und den Zugriff auf die REST-API des Schulconnex-Services ermöglicht."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Client Secret",
      "rationale": "Ein sicherheitsrelevantes Element, das zur Authentifizierung des Quellsystems bei der REST-API des Schulconnex-Services verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Mandant",
      "rationale": "Bezeichnet eine abgeschlossene und klar abgegrenzte Datenhaltungs- und Verarbeitungseinheit im Schulconnex-Service, die einer Organisation zugeordnet ist."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Personenkontext",
      "rationale": "Kontext einer Person, der eine Organisation und eine Rolle der Person in Bezug auf diese Organisation umfasst, wie z. B. Schulleitung einer Schule."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "UUID",
      "rationale": "Steht für Universally Unique Identifier und wird im Schulconnex-Service als eindeutiger Schlüssel zur Identifikation von Datensätzen verwendet."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Fremdschlüssel",
      "rationale": "Ein Schlüssel, der in einem Quellsystem gespeichert wird, um Datensätze eindeutig mit dem Schulconnex-Service zu verknüpfen."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "/personen",
      "rationale": "Ein Endpunkt der REST-API des Schulconnex-Services, über den Datensätze von Personen abgerufen werden können."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "/personenkontexte",
      "rationale": "Ein Endpunkt der REST-API des Schulconnex-Services, über den Datensätze von Personenkontexten abgerufen werden können."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "/gruppen",
      "rationale": "Ein Endpunkt der REST-API des Schulconnex-Services, über den Datensätze von Gruppen abgerufen werden können."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "/gruppenzugehoerigkeiten",
      "rationale": "Ein Endpunkt der REST-API des Schulconnex-Services, über den Datensätze von Gruppenzugehörigkeiten abgerufen werden können."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "PUT",
      "rationale": "Eine HTTP-Methode, die in der REST-API des Schulconnex-Services für die Aktualisierung von Datensätzen verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "POST",
      "rationale": "Eine HTTP-Methode, die in der REST-API des Schulconnex-Services für das Anlegen neuer Datensätze verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "DELETE",
      "rationale": "Eine HTTP-Methode, die in der REST-API des Schulconnex-Services für das Löschen von Datensätzen verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/ablauf-synchronisation.md",
      "term": "Revision",
      "rationale": "Ein Attribut, das bei der Aktualisierung von Datensätzen über die REST-API des Schulconnex-Services mitgegeben werden muss, um die Version des Datensatzes zu kennzeichnen."
    },
    {
      "file": "docs/praxisleitfaden/praxisleitfaden.md",
      "term": "Quellsysteme-API",
      "rationale": "Die Quellsysteme-API ist eine spezifische Schnittstelle des Schulconnex-Servers, die es Quellsystemen ermöglicht, Daten mit einem Schulconnex-Service zu synchronisieren."
    },
    {
      "file": "docs/praxisleitfaden/praxisleitfaden.md",
      "term": "Schulconnex-Server",
      "rationale": "Der Schulconnex-Server ist eine zentrale technische Komponente des Schulconnex-Systems, die für die Datenverarbeitung und -synchronisation zwischen Diensten und Quellsystemen zuständig ist."
    },
    {
      "file": "docs/praxisleitfaden/praxisleitfaden.md",
      "term": "Schulconnex-Service",
      "rationale": "Ein Schulconnex-Service ist ein Dienst, der den Vorgaben der Schulconnex-Spezifikation folgt und mit dem Schulconnex-Server interagiert."
    },
    {
      "file": "docs/praxisleitfaden/rolle-in-organisation.md",
      "term": "Personenkontext",
      "rationale": "Kontext der Person, in dem ein Dienst genutzt wird. Ein Personenkontext umfasst eine Organisation und eine Rolle der nutzenden Person in Bezug auf diese Organisation, also beispielsweise Schulleitung des Heinrich-Heine-Gymnasiums."
    },
    {
      "file": "docs/praxisleitfaden/rolle-in-organisation.md",
      "term": "API-Schnittstelle",
      "rationale": "Bezeichnet eine Programmierschnittstelle, die es ermöglicht, Daten und Funktionen zwischen verschiedenen Softwareanwendungen auszutauschen. Im Kontext der Schulconnex-Dokumentation ist dies ein zentraler technischer Begriff."
    },
    {
      "file": "docs/praxisleitfaden/rolle-in-organisation.md",
      "term": "Personenkontext-ID",
      "rationale": "Eindeutige Kennung eines Personenkontexts, die zur Identifikation und Verarbeitung in der Schnittstelle verwendet wird."
    },
    {
      "file": "docs/praxisleitfaden/rolle-in-organisation.md",
      "term": "Administratorrolle",
      "rationale": "Bezeichnet eine Rolle mit erweiterten Berechtigungen, die typischerweise für administrative Aufgaben innerhalb einer Organisation zuständig ist."
    }
  ]
}